"""phoneme.py
"""

from __future__ import unicode_literals

# TO BE IMPROVED
IPA_PHONEME_CODEC = {
    "CONSONANTS": {
        "p": "p",
        "b": "b",
        "t": "t",
        "d": "d",
        "ʈ": "t`",
        "ɖ": "d`",
        "c": "c",
        "ɟ": "J\\",
        "k": "k",
        "ɡ": "g",
        "q": "q",
        "ɢ": "G\\",
        "ʔ": "?",
        "m": "m",
        "ɱ": "F",
        "n": "n",
        "ɳ": "n`",
        "ɲ": "J",
        "ŋ": "N",
        "ɴ": "N\\",
        "ʙ": "B\\",
        "r": "r",
        "ʀ": "R\\",
        "ⱱ": "v`",
        "ɾ": "4",
        "ɽ": "r`",
        "ɸ": "p\\",
        "β": "B",
        "f": "f",
        "v": "v",
        "θ": "T",
        "ð": "D",
        "s": "s",
        "z": "z",
        "ʃ": "S",
        "ʒ": "Z",
        "ʂ": "s`",
        "ʐ": "z`",
        "ç": "C",
        "ʝ": "j\\",
        "x": "x",
        "ɣ": "G",
        "χ": "X",
        "ʁ": "R",
        "ħ": "X\\",
        "ʕ": "?\\",
        "h": "h",
        "ɦ": "h\\",
        "ɬ": "K",
        "ɮ": "K\\",
        "ʋ": "P",
        "ɹ": "r\\",
        "ɻ": "r\\`",
        "j": "j",
        "ɰ": "M\\",
        "l": "l",
        "ɭ": "l`",
        "ʎ": "L",
        "ʟ": "L\\",
    },
    "NON_PULMONIC_CONSONANTS": {
        "ʘ": "O\\",
        "ǀ": "|\\",
        "ǃ": "!\\",
        "ǂ": "=\\",
        "ǁ": "|\\|\\",
        "ɓ": "b_<",
        "ɗ": "d_<",
        "ʄ": "J\\_<",
        "ɠ": "g_<",
        "ʛ": "G\\_<",
        "ʼ": "_>",
        "tʼ": "t_>",
    },
    "VOWELS": {
        "i": "i",
        "y": "y",
        "ɨ": "1",
        "ʉ": "}",
        "ɯ": "M",
        "u": "u",
        "ɪ": "I",
        "ʏ": "Y",
        "ʊ": "U",
        "e": "e",
        "ø": "2",
        "ɘ": "@\\",
        "ɵ": "8",
        "ɤ": "7",
        "o": "o",
        "ə": "@",
        "ɛ": "E",
        "œ": "9",
        "ɜ": "3",
        "ɞ": "3\\",
        "ʌ": "V",
        "ɔ": "O",
        "æ": "{",
        "ɐ": "6",
        "a": "a",
        "ɶ": "&",
        "ɑ": "A",
        "ɒ": "Q",
    },
    "OTHER_SYMBOLS": {
        "ʍ": "W",
        "ɕ": "s\\",
        "ʑ": "z\\",
        "w": "w",
        "ɺ": "l\\",
        "ɥ": "H",
        "ɧ": "x\\",
        "ʜ": "H\\",
        "ʢ": "<\\",
        "ʡ": ">\\",
    },
    "SUPRASEGMENTALS": {
        "ˈ": "\"",
        "ˌ": "%",
        "ː": ":",
        "ˑ": ":\\",
        "|": "|",
        "‖": "||",
        ".": ".",
        "‿": "-\\",
    },
}

def ipa2xsampa(ipa):
    """ipa2xsampa
    """
    mapping = {}
    for t in IPA_PHONEME_CODEC.keys():
        for k in IPA_PHONEME_CODEC[t].keys():
            mapping[k] = IPA_PHONEME_CODEC[t][k]
    xsampa = ""
    i = 0
    while i < len(ipa):
        if ipa[i] in mapping.keys():
            xsampa += mapping[ipa[i]]
        else:
            #TODO
            #oov handle
            pass
        i += 1
    return xsampa
